Unet training with CHN data.
Data Information
    Train data: 452
    Valid data: 57
    Test data: 57
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 512, 512]             320
              ReLU-2         [-1, 32, 512, 512]               0
            Conv2d-3         [-1, 32, 512, 512]           9,248
              ReLU-4         [-1, 32, 512, 512]               0
        Downsample-5         [-1, 32, 512, 512]               0
         MaxPool2d-6         [-1, 32, 256, 256]               0
            Conv2d-7         [-1, 64, 256, 256]          18,496
              ReLU-8         [-1, 64, 256, 256]               0
            Conv2d-9         [-1, 64, 256, 256]          36,928
             ReLU-10         [-1, 64, 256, 256]               0
       Downsample-11         [-1, 64, 256, 256]               0
        MaxPool2d-12         [-1, 64, 128, 128]               0
           Conv2d-13        [-1, 128, 128, 128]          73,856
             ReLU-14        [-1, 128, 128, 128]               0
           Conv2d-15        [-1, 128, 128, 128]         147,584
             ReLU-16        [-1, 128, 128, 128]               0
       Downsample-17        [-1, 128, 128, 128]               0
        MaxPool2d-18          [-1, 128, 64, 64]               0
           Conv2d-19          [-1, 256, 64, 64]         295,168
             ReLU-20          [-1, 256, 64, 64]               0
           Conv2d-21          [-1, 256, 64, 64]         590,080
             ReLU-22          [-1, 256, 64, 64]               0
       Downsample-23          [-1, 256, 64, 64]               0
        MaxPool2d-24          [-1, 256, 32, 32]               0
           Conv2d-25          [-1, 512, 32, 32]       1,180,160
             ReLU-26          [-1, 512, 32, 32]               0
           Conv2d-27          [-1, 512, 32, 32]       2,359,808
             ReLU-28          [-1, 512, 32, 32]               0
       Downsample-29          [-1, 512, 32, 32]               0
  ConvTranspose2d-30          [-1, 256, 64, 64]         524,544
           Conv2d-31          [-1, 256, 64, 64]       1,179,904
             ReLU-32          [-1, 256, 64, 64]               0
           Conv2d-33          [-1, 256, 64, 64]         590,080
             ReLU-34          [-1, 256, 64, 64]               0
         Upsample-35          [-1, 256, 64, 64]               0
  ConvTranspose2d-36        [-1, 128, 128, 128]         131,200
           Conv2d-37        [-1, 128, 128, 128]         295,040
             ReLU-38        [-1, 128, 128, 128]               0
           Conv2d-39        [-1, 128, 128, 128]         147,584
             ReLU-40        [-1, 128, 128, 128]               0
         Upsample-41        [-1, 128, 128, 128]               0
  ConvTranspose2d-42         [-1, 64, 256, 256]          32,832
           Conv2d-43         [-1, 64, 256, 256]          73,792
             ReLU-44         [-1, 64, 256, 256]               0
           Conv2d-45         [-1, 64, 256, 256]          36,928
             ReLU-46         [-1, 64, 256, 256]               0
         Upsample-47         [-1, 64, 256, 256]               0
  ConvTranspose2d-48         [-1, 32, 512, 512]           8,224
           Conv2d-49         [-1, 32, 512, 512]          18,464
             ReLU-50         [-1, 32, 512, 512]               0
           Conv2d-51         [-1, 32, 512, 512]           9,248
             ReLU-52         [-1, 32, 512, 512]               0
         Upsample-53         [-1, 32, 512, 512]               0
           Conv2d-54          [-1, 1, 512, 512]              33
          Sigmoid-55          [-1, 1, 512, 512]               0
================================================================
Total params: 7,759,521
Trainable params: 7,759,521
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.00
Forward/backward pass size (MB): 1374.00
Params size (MB): 29.60
Estimated Total Size (MB): 1404.60
----------------------------------------------------------------
[ Start test ]
  0%|          | 0/57 [00:00<?, ?it/s]  2%|▏         | 1/57 [00:01<00:56,  1.01s/it]  4%|▎         | 2/57 [00:01<00:26,  2.05it/s]  5%|▌         | 3/57 [00:01<00:17,  3.11it/s]  9%|▉         | 5/57 [00:01<00:13,  3.99it/s] 16%|█▌        | 9/57 [00:02<00:09,  4.82it/s] 23%|██▎       | 13/57 [00:03<00:08,  5.11it/s] 28%|██▊       | 16/57 [00:03<00:05,  7.04it/s] 32%|███▏      | 18/57 [00:03<00:07,  5.11it/s] 37%|███▋      | 21/57 [00:04<00:07,  4.97it/s] 44%|████▍     | 25/57 [00:05<00:06,  4.82it/s] 51%|█████     | 29/57 [00:06<00:05,  5.03it/s] 58%|█████▊    | 33/57 [00:06<00:04,  4.98it/s] 65%|██████▍   | 37/57 [00:07<00:03,  5.17it/s] 72%|███████▏  | 41/57 [00:08<00:03,  5.25it/s] 79%|███████▉  | 45/57 [00:09<00:02,  5.45it/s] 86%|████████▌ | 49/57 [00:09<00:01,  5.74it/s] 91%|█████████ | 52/57 [00:09<00:00,  7.14it/s] 95%|█████████▍| 54/57 [00:10<00:00,  6.01it/s] 98%|█████████▊| 56/57 [00:10<00:00,  6.43it/s]100%|██████████| 57/57 [00:10<00:00,  5.30it/s]
    test loss = -0.929
    Dice coefficient = 0.929
[ End test ]
